In [1]:
import numpy as np
import pandas as pd
df = pd.read_csv('C:/Users/User/Desktop/data science/data sets/titanic.csv')

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,Embarked,WikiId,Name_wiki,Age_wiki,Hometown,Boarded,Destination,Lifeboat,Body,Class
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,...,S,691.0,"Braund, Mr. Owen Harris",22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada",NaN,NaN,3.0
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,...,C,90.0,"Cumings, Mrs. Florence Briggs (née Thayer)",35.0,"New York, New York, US",Cherbourg,"New York, New York, US",4,NaN,1.0
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,...,S,865.0,"Heikkinen, Miss Laina",26.0,"Jyväskylä, Finland",Southampton,New York City,14?,NaN,3.0
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,...,S,127.0,"Futrelle, Mrs. Lily May (née Peel)",35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US",D,NaN,1.0
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,...,S,627.0,"Allen, Mr. William Henry",35.0,"Birmingham, West Midlands, England",Southampton,New York City,NaN,NaN,3.0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked','WikiId','Name_wiki','Age_wiki','Hometown','Boarded','Destination','Lifeboat','Body','Class'],axis=1,inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0       0.0       3    male  22.0   7.2500
1       1.0       1  female  38.0  71.2833
2       1.0       3  female  26.0   7.9250
3       1.0       1  female  35.0  53.1000
4       0.0       3    male  35.0   8.0500

In [104]:
target = df.Survived.fillna(df.Survived.median())
target

0       0.0
1       1.0
2       1.0
3       1.0
4       0.0
       ...
1304    0.0
1305    0.0
1306    0.0
1307    0.0
1308    0.0
Name: Survived, Length: 1309, dtype: float64

In [105]:
inputs = df.drop('Survived',axis=1)
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [106]:
dumies = pd.get_dummies(inputs.Sex)
dumies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [107]:
inputs = pd.concat([inputs,dumies],axis=1)
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [108]:
inputs.drop('Sex',axis=1,inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [109]:
inputs.columns[inputs.isna().any()]

Index(['Age', 'Fare'], dtype='object')

In [110]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [111]:
inputs.Fare[:]

0         7.2500
1        71.2833
2         7.9250
3        53.1000
4         8.0500
          ...
1304      8.0500
1305    108.9000
1306      7.2500
1307      8.0500
1308     22.3583
Name: Fare, Length: 1309, dtype: float64

In [112]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.Fare = inputs.Fare.fillna(inputs.Fare.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.881138   8.4583       0     1

In [113]:
inputs

      Pclass        Age      Fare  female  male
0          3  22.000000    7.2500       0     1
1          1  38.000000   71.2833       1     0
2          3  26.000000    7.9250       1     0
3          1  35.000000   53.1000       1     0
4          3  35.000000    8.0500       0     1
...      ...        ...       ...     ...   ...
1304       3  29.881138    8.0500       0     1
1305       1  39.000000  108.9000       1     0
1306       3  38.500000    7.2500       0     1
1307       3  29.881138    8.0500       0     1
1308       3  29.881138   22.3583       0     1

[1309 rows x 5 columns]

In [126]:
target

0       0.0
1       1.0
2       1.0
3       1.0
4       0.0
       ...
1304    0.0
1305    0.0
1306    0.0
1307    0.0
1308    0.0
Name: Survived, Length: 1309, dtype: float64

In [137]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(inputs,target,test_size=0.2)

In [138]:
len(x_train)

1047

In [139]:
len(x_test)

262

In [140]:
len(inputs)

1309

In [141]:
len(y_train)

1047

In [142]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [143]:
model.fit(x_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [144]:
model.score(x_test,y_test)

0.7290076335877863

In [145]:
x_test[:10]

      Pclass        Age      Fare  female  male
244        3  30.000000    7.2250       0     1
380        1  42.000000  227.5250       1     0
1084       2  61.000000   12.3500       0     1
450        2  36.000000   27.7500       0     1
493        1  71.000000   49.5042       0     1
1070       1  64.000000   83.1583       1     0
165        3   9.000000   20.5250       0     1
834        3  18.000000    8.3000       0     1
1145       3  32.500000    9.5000       0     1
1308       3  29.881138   22.3583       0     1

In [149]:
model.predict(x_test[:10])

array([0., 1., 0., 0., 0., 1., 0., 0., 0., 0.])

In [150]:
y_test[:10]

244     0.0
380     1.0
1084    0.0
450     0.0
493     0.0
1070    0.0
165     1.0
834     0.0
1145    0.0
1308    0.0
Name: Survived, dtype: float64

In [151]:
model.predict_proba(x_test[:10])

array([[9.85726032e-01, 1.42739679e-02],
       [4.11995684e-04, 9.99588004e-01],
       [9.78959437e-01, 2.10405626e-02],
       [9.74535168e-01, 2.54648322e-02],
       [9.44788220e-01, 5.52117797e-02],
       [8.34205855e-02, 9.16579414e-01],
       [9.81464613e-01, 1.85353868e-02],
       [9.83748541e-01, 1.62514595e-02],
       [9.86065413e-01, 1.39345869e-02],
       [9.85408384e-01, 1.45916156e-02]])